<a href="https://colab.research.google.com/github/viviviannnnn/python/blob/main/My_SQL%E5%89%B5%E5%BB%BA%E5%85%AC%E5%8F%B8%E8%B3%87%E6%96%99%E5%BA%AB_code%E5%82%99%E4%BB%BD.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# USE `sql_class`;

# CREATE TABLE `employee`(
# 	`emp_id` INT PRIMARY KEY,
#     `name` VARCHAR(20),
#     `birth_date` DATE,
#     `sex` VARCHAR(20),
#     `salary` INT,
#     `branch_id` INT,
#     `sup_id` INT
#     );

# CREATE TABLE `branch`(
# 	`branch_id`INT PRIMARY KEY,
#     `branch_name` VARCHAR(20),
#     `manager_id` INT,
#     FOREIGN KEY (`manager_id`) REFERENCES `employee`(`emp_id`) ON DELETE SET NULL
#     );

# ALTER TABLE`employee`
# ADD FOREIGN KEY (`branch_id`)
# REFERENCES `branch`(`branch_id`)
# ON DELETE SET NULL;

# ALTER TABLE`employee`
# ADD FOREIGN KEY (`sup_id`)
# REFERENCES `employee`(`emp_id`)
# ON DELETE SET NULL;

# CREATE TABLE `client`(
# 	`client_id` INT PRIMARY KEY,
#     `client_name` VARCHAR(20),
#     `phone` VARCHAR(20)
#     );

# CREATE TABLE `works_with`(
# 	`emp_id` INT,
#     `client_id` INT,
#     `total_sales` INT,
#     PRIMARY KEY (`emp_id`,`client_id`),
#     FOREIGN KEY (`emp_id`) REFERENCES `employee`(`emp_id`) ON DELETE CASCADE,
#     FOREIGN KEY (`client_id`) REFERENCES `client`(`client_id`) ON DELETE CASCADE
#     );

# DROP TABLE `work_with`;
# DESCRIBE`work_with`;

In [ ]:
# -- 新增公司資料進去

# INSERT INTO `branch` VALUES(1, '研發', NULL);
# INSERT INTO `branch` VALUES(2, '行政', NULL);
# INSERT INTO `branch` VALUES(3, '資訊', NULL);

# INSERT INTO `employee` VALUES(206, '小黃', '1998-10-8', 'F', 50000, 1, NULL);
# INSERT INTO `employee` VALUES(207, '小綠', '1985-09-16', 'M', 29000, 2, 206);
# INSERT INTO `employee` VALUES(208, '小黑', '2000-12-19', 'M', 35000, 3, 207);
# INSERT INTO `employee` VALUES(209, '小白', '1997-01-22', 'F', 39000, 3, 207);
# INSERT INTO `employee` VALUES(210, '小藍', '1925-11-10', 'F', 84000, 1, 207);

# UPDATE`branch`
# SET`manager_id` = 208
# WHERE `branch_id` = 3;

# INSERT INTO `client` VALUES(400, '阿狗', '254354335');
# INSERT INTO `client` VALUES(401, '阿貓', '25633899');
# INSERT INTO `client` VALUES(402, '旺來', '45354345');
# INSERT INTO `client` VALUES(403, '露西', '54354365');
# INSERT INTO `client` VALUES(404, '艾瑞克', '18783783');

# INSERT INTO `works_with` VALUES(206,400,70000 );
# INSERT INTO `works_with` VALUES(207,401,24000);
# INSERT INTO `works_with` VALUES(208,402,9800);
# INSERT INTO `works_with` VALUES(209,403,24000);
# INSERT INTO `works_with` VALUES(210,404,87940);


# SELECT * FROM `employee`;

In [ ]:
# -- 練習

# -- 取得所有員工資料
# SELECT * FROM`employee`;
# -- 取得所有客戶資料
# SELECT * FROM`client`;
# -- 按薪水低到高取得員工資料
# SELECT * FROM`employee`
# ORDER BY `salary`;
# -- 取得薪水前三高的員工
# SELECT * FROM `employee`
# ORDER BY `salary` DESC
# LIMIT 3;
# -- 取得所有員工名字
# SELECT `name` FROM `employee`;

# -- 取得所有員工性別且不重複
# SELECT DISTINCT `sex` FROM `employee`;

In [ ]:
# -- 聚合函數 aggregate functions

# -- 取得員工人數
# SELECT COUNT(*) FROM `employee`; -- 看總共幾筆資料
# SELECT COUNT(`sup_id`) FROM `employee`;

# -- 取得所有出生於1970-01-01之後的女性員工人數
# SELECT COUNT(*) FROM `employee`
# WHERE `birth_date`> '1970-01-01' AND `sex` = 'F';

# -- 取得所有員工的平均薪水
# SELECT AVG(`salary`) FROM `employee`;

# -- 取得所有員工薪水總合
# SELECT SUM(`salary`) FROM `employee`;

# -- 取得薪水最高的員工
# SELECT MAX(`salary`) FROM `employee`;

# -- 取得薪水最低的員工
# SELECT MIN(`salary`) FROM `employee`;

In [ ]:
# -- wildcards萬用字元  ％代表多個字元, _代表一個字元alter

# -- 取得電話號碼尾數是335的客戶
# SELECT * FROM `client` WHERE `phone` LIKE '%335';
# -- 取得電話號碼中間有354的客戶
# SELECT * FROM `client` WHERE  `phone` LIKE '%354%';

# -- 取得姓艾的客戶
# SELECT * FROM `client` WHERE `client_name` LIKE '艾%';

# -- 取得生日在12月的員工
# SELECT * FROM `employee` WHERE `birth_date` LIKE '_____12%';

In [ ]:
# -- union聯集

# -- 員工名字 union 客戶名字 union 部門名稱
# SELECT `name` FROM `employee`
# UNION
# SELECT `client_name` FROM `client`
# UNION
# SELECT `branch_name` FROM `branch`;

# -- 員工id+員工名字 union 客戶id+客戶名字
# SELECT `emp_id` AS `total_id` ,`name` AS `total_name` FROM `employee`
# UNION
# SELECT `client_id`,`client_name` FROM `client`;

# -- 員工薪水 union 銷售金額
# SELECT `salary`  AS `total_money` FROM `employee`
# UNION
# SELECT `total_sales` FROM `works_with`;

In [ ]:
# -- union聯集

# -- 員工名字 union 客戶名字 union 部門名稱
# SELECT `name` FROM `employee`
# UNION
# SELECT `client_name` FROM `client`
# UNION
# SELECT `branch_name` FROM `branch`;

# -- 員工id+員工名字 union 客戶id+客戶名字
# SELECT `emp_id` AS `total_id` ,`name` AS `total_name` FROM `employee`
# UNION
# SELECT `client_id`,`client_name` FROM `client`;

# -- 員工薪水 union 銷售金額
# SELECT `salary`  AS `total_money` FROM `employee`
# UNION
# SELECT `total_sales` FROM `works_with`;

In [ ]:
# -- union聯集

# -- 員工名字 union 客戶名字 union 部門名稱
# SELECT `name` FROM `employee`
# UNION
# SELECT `client_name` FROM `client`
# UNION
# SELECT `branch_name` FROM `branch`;

# -- 員工id+員工名字 union 客戶id+客戶名字
# SELECT `emp_id` AS `total_id` ,`name` AS `total_name` FROM `employee`
# UNION
# SELECT `client_id`,`client_name` FROM `client`;

# -- 員工薪水 union 銷售金額
# SELECT `salary`  AS `total_money` FROM `employee`
# UNION
# SELECT `total_sales` FROM `works_with`;

In [ ]:
# -- on delete

# DELETE FROM `employee`
# WHERE `emp_id` = 207;

# SELECT * FROM `branch`;
# SELECT * FROM `works_with`;

# -- primary key 不可為 NULL，所以要寫ON DELETE CASCADE